croll83/jarvis/atoms3r-jarvis/sdkconfig.defaults
# =============================================================================
# JARVIS AtomS3R - ESP-IDF SDK Configuration Defaults
# =============================================================================
#
# Hardware: M5Stack AtomS3R (ESP32-S3-PICO-1-N8R8)
# - Flash: 8MB (Octal SPI)
# - PSRAM: 8MB (Octal SPI)
#
# =============================================================================

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# =============================================================================
# Flash Configuration (8MB OPI)
# =============================================================================
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# =============================================================================
# PSRAM Configuration (8MB OPI - ESSENZIALE per ESP-SR)
# =============================================================================
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# PSRAM timing tuning per OPI
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# =============================================================================
# Partition Table
# =============================================================================
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# =============================================================================
# ESP-SR WakeNet Configuration
# =============================================================================
CONFIG_SR_WN_WN9_JARVIS_TTS=y
CONFIG_AFE_INTERFACE_V1=y

# Disable ALL MultiNet models (not needed - JARVIS uses only WakeNet)
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y

# =============================================================================
# CPU and FreeRTOS
# =============================================================================
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_FREERTOS_HZ=1000

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# Task Watchdog (più tollerante durante init pesante)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# =============================================================================
# WiFi
# =============================================================================
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# =============================================================================
# TLS / HTTPS (per connessione a jarvis.mintwork.it:443)
# =============================================================================
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# =============================================================================
# I2S/I2C Legacy API (suppress deprecation warnings)
# =============================================================================
CONFIG_I2S_SUPPRESS_DEPRECATE_WARN=y
CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y

# =============================================================================
# Log Level
# =============================================================================
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# =============================================================================
# Bootloader
# =============================================================================
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y

# =============================================================================
# Compiler Optimization (per risparmiare flash)
# =============================================================================
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# =============================================================================
# Device Configuration (da personalizzare via menuconfig)
# =============================================================================
CONFIG_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_WIFI_PASSWORD="YOUR_WIFI_PASSWORD"
CONFIG_JARVIS_SERVER_HOST="jarvis.local"
CONFIG_JARVIS_SERVER_PORT=5000
CONFIG_JARVIS_API_TOKEN=""
# NOTA: DEVICE_ROOM e DEVICE_ID rimossi.
# Il device_id è ora il MAC address (letto a runtime).
# La configurazione viene recuperata dal server via /device_config.
